      	IDENTIFICATION DIVISION.
        PROGRAM-ID. CONTROL. 
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 03/01/2026. 
        DATE-COMPILED. 03/01/2026. 
        SECURITY. free.
      * THIS PROGRAM TESTS IF BRANCHES.
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 REC0.
			03 WS-CODE PIC X(4) VALUE "MESS".
			03 A-CODE PIC X(5)  VALUE "MESSY".
       01 I BINARY-LONG.
      *	WS-CODE A-CODE
      *	MESS    MESSY
      *	ABCD   1234
      *	ABC    ABCD
      *	ABC1   ABCZ
        PROCEDURE DIVISION.
        MOVE 0 TO I.
		DISPLAY "WS-CODE = " WS-CODE " A-CODE = " A-CODE.
        PARA-IF.
        IF WS-CODE < A-CODE
			GO TO PARA-TRUE
		ELSE
			GO TO PARA-FALSE.	
		PARA-TRUE.
			DISPLAY "THE CONDITION IS TRUE".
			GO TO PARA-CONT.
		PARA-FALSE.
			DISPLAY "THE CONDITION IS FALSE".
		PARA-CONT.
		ADD 1 TO I.
		DISPLAY "I = " I.
		IF I = 2 GO TO DATA-2.
		IF I = 3 GO TO DATA-3.
		IF I > 3 GO TO PARA-END.
		MOVE "ABCD" TO WS-CODE.
		MOVE "1234" TO A-CODE.
		DISPLAY "WS-CODE = " WS-CODE " A-CODE = " A-CODE 
		GO TO PARA-IF.
		DATA-2.
		MOVE "ABC" TO WS-CODE.
		MOVE "ABCD" TO A-CODE.
		DISPLAY "WS-CODE = " WS-CODE " A-CODE = " A-CODE 
		GO TO PARA-IF.
		DATA-3.
		MOVE "ABC1" TO WS-CODE.
		MOVE "ABCZ" TO A-CODE.
		DISPLAY "WS-CODE = " WS-CODE " A-CODE = " A-CODE 
		GO TO PARA-IF.
		PARA-END.
		STOP RUN.
