        IDENTIFICATION DIVISION.
        PROGRAM-ID. CRYT.
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 06/01/2026. 
        DATE-COMPILED. 06/01/2026. 
        SECURITY. free.
      * THIS CREATE AN INPUT FILE FOR PROGRAM EX01 .
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        INPUT-OUTPUT SECTION. 
        FILE-CONTROL.
          SELECT OUT-FILE ASSIGN "IN01.dat".
        DATA DIVISION.
        FILE SECTION.
		FD OUT-FILE.
		01 OUT-REC.
			03 OUT-MONTH PIC 99.
			03 OUT-AMOUNT PIC 9(6)V99.
		    03 LF       PIC X.
		WORKING-STORAGE SECTION.
		01 CNT-MON   PIC 99 VALUE 1.
		01 AM-BUF    PIC 9(6)V99 VALUE 50.25.    
		01 WR-REC    PIC 9(3) VALUE 0.
        PROCEDURE DIVISION.
		AA-START.
		  OPEN OUTPUT OUT-FILE.
		CC-ADDREC.
			IF WR-REC = 13 GO TO ZZ-END.
			COMPUTE CNT-MON = WR-REC + 1.
			MOVE CNT-MON TO OUT-MONTH.
			COMPUTE AM-BUF = AM-BUF + 50.25*WR-REC.
			MOVE FUNCTION CHAR(11) TO LF.
			MOVE AM-BUF TO OUT-AMOUNT.
			WRITE OUT-REC
			ADD 1 TO WR-REC.
		GO TO CC-ADDREC.
	    ZZ-END.
	      COMPUTE WR-REC = WR-REC - 1.
	      DISPLAY WR-REC " RECORDS WRITTEN".
		  DISPLAY "PROGRAM ENDED: EXITING".
          CLOSE OUT-FILE. 
		  STOP RUN.
