		IDENTIFICATION DIVISION.
        PROGRAM-ID. DIV. 
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 02/01/2026. 
        DATE-COMPILED. 02/01/2026. 
        SECURITY. free.
      * THIS PROGRAM SHOWS HOW TO USE DIVIDE IN COBOL
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        DATA DIVISION. 
        WORKING-STORAGE SECTION.
        01 A-NUM			PIC S9(5) VALUE 4.
        01 B-NUM			PIC S9(5) VALUE 8.
        01 C-NUM			PIC S9(5) VALUE 0.
        01 FAC BINARY-LONG VALUE 1.
        01 I BINARY-LONG.
        01 TOTAL-MONEY 	    PIC S9(4)V99 COMP VALUE 50.35.
		01 TOT-MON1 		PIC 9(6) VALUE 123456.
		01 TOT-MON2 		PIC 9(6) VALUE 123.
        01 TOT-MON3 		PIC 9(7) VALUE 1234567.
        01 TOT-MON4 		PIC S9(6) VALUE 1234.
		01 TOT-MON5 		PIC 9(4)V99 VALUE 123.45.
		01 TOT-MON6 		PIC 9(4)V99 VALUE 1234.5.
        01 TOT-MON7         PIC S9(4)V99 VALUE 1234.56.
		01 TOT-MON8         PIC 9(6) COMP-3 VALUE 123456.
        01 SWITCH-A COMP-5	PIC 1  VALUE 0.
		01 TOT-MON9  COMP-3		PIC 9(7)  VALUE 123456.
		01 WS-C 				PIC A(5).
		01 WS-D 				PIC 1(3).
		01 WS-NUM				PIC 9(7).
		01 WS-DEC				PIC 9(4)V99.
		01 WS-NAME				PIC X(20).
		01 WS-BIT				PIC 1(3).
		01 WS-BIN  COMP         PIC 9(4).
		01 WS-PACK COMP-3       PIC 9(5).
		01 WS-A                 PIC X(10)   VALUE "REPORT    ".
		01 WS-B    COMP-3       PIC 9(5)    VALUE  123.
		01 WS-C1                 PIC 9(3)V99 VALUE 23.50.
		01 WS-D1                 PIC X(10) VALUE "     DAY".
		01 WS-E COMP SYNC RIGHT PIC  9(6) VALUE  ZEROS.
		01 WS-F                 PIC X(7) VALUE  "*******".
		01 WS-G  COMP-5         PIC 1(2) VALUE  3.
        PROCEDURE DIVISION.
        DISPLAY "A-NUM = " A-NUM " B-NUM = " B-NUM " C-NUM = " C-NUM.
        DIVIDE A-NUM INTO B-NUM GIVING C-NUM.
        DISPLAY "B-NUM / A-NUM = "  C-NUM.
        ADD A-NUM B-NUM TO C-NUM.
        DISPLAY "A-NUM + B-NUM + C-NUM = "  C-NUM.
        SUBTRACT B-NUM FROM C-NUM GIVING A-NUM.
        DISPLAY "C-NUM - B-NUM = " A-NUM.
        MULTIPLY A-NUM BY B-NUM GIVING C-NUM.
        DISPLAY "A-NUM * B-NUM = " C-NUM.
        COMPUTE A-NUM = C-NUM - B-NUM
        DISPLAY "A-NUM = " A-NUM
        COMPUTE C-NUM = A-NUM + A-NUM
        DISPLAY "C-NUM = " C-NUM 
        COMPUTE C-NUM = C-NUM * 2
        DISPLAY "C-NUM = " C-NUM 
        COMPUTE A-NUM = C-NUM / B-NUM
        DISPLAY "A-NUM = " A-NUM 
        COMPUTE C-NUM = A-NUM ** 2
        DISPLAY "C-NUM = " C-NUM 
        COMPUTE C-NUM = C-NUM / (A-NUM + A-NUM)        
        DISPLAY "C-NUM = " C-NUM 
        PERFORM VARYING I FROM 1 BY 1 UNTIL I > C-NUM
          COMPUTE FAC=I*FAC
        END-PERFORM
		DISPLAY "FAC(" C-NUM ") = " FAC
		DISPLAY "TOTAL-MONEY = " TOTAL-MONEY
		MOVE 1020.12 TO TOTAL-MONEY
		DISPLAY "TOTAL-MONEY = " TOTAL-MONEY
		MOVE 77044.95 TO TOTAL-MONEY
		DISPLAY "TOTAL-MONEY = " TOTAL-MONEY
		MOVE -8132.63 TO TOTAL-MONEY
		DISPLAY "TOTAL-MONEY = " TOTAL-MONEY
		DISPLAY "TOT-MON1 = " TOT-MON1
		DISPLAY "TOT-MON2 = " TOT-MON2
        DISPLAY "TOT-MON3 = " TOT-MON3
		MOVE -1234 TO TOT-MON4
        DISPLAY "TOT-MON4 = " TOT-MON4
		DISPLAY "TOT-MON5 = " TOT-MON5
		DISPLAY "TOT-MON6 = " TOT-MON6
		MOVE -1234.56 TO TOT-MON7
   		DISPLAY "TOT-MON7 = " TOT-MON7
		DISPLAY "TOT-MON8 = " TOT-MON8
		DISPLAY "TOT-MON9 = " TOT-MON9
		DISPLAY "SWITCH-A = " SWITCH-A
		MOVE 1 TO SWITCH-A
		DISPLAY "SWITCH-A = " SWITCH-A
		MOVE "tr123" TO WS-C
		DISPLAY "WS-C = " WS-C
		MOVE 101 TO WS-D
		DISPLAY "WS-D = " WS-D
		COMPUTE WS-D = 10 + 01
		DISPLAY "WS-D = " WS-D
		MOVE 10 TO WS-PACK
		DISPLAY "WS-PACK = " WS-PACK
		COMPUTE WS-PACK = 10 + 10
		DISPLAY "WS-PACK = " WS-PACK
		DISPLAY "WS-A = " WS-A
		DISPLAY "WS-B = " WS-B
		DISPLAY "WS-C1 = " WS-C1
		DISPLAY "WS-D1 = " WS-D1
		DISPLAY "WS-E = " WS-E
		DISPLAY "WS-F = " WS-F
		DISPLAY "WS-G = " WS-G
		STOP RUN.
