        IDENTIFICATION DIVISION.
        PROGRAM-ID. FINDERR. 
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 05/01/2026. 
        DATE-COMPILED. 05/01/2026. 
        SECURITY. free.
      * THIS PROGRAM CREATES MASTER AND AMENDMENT FILE TO USE AS INPUT.
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        INPUT-OUTPUT SECTION. 
        FILE-CONTROL.
          SELECT IN-FILE ASSIGN "in-file.dat".
          SELECT OUT-FILE ASSIGN "out-file.dat".
        DATA DIVISION.
        FILE SECTION.
		FD IN-FILE.
		01 IN-REC.
		  03 IN-GROUP PIC X(5).
		  03 IN-LF    PIC X.
		FD OUT-FILE.
		01 OUT-REC.  
		  03 OUT-GROUP PIC X(5).
		  03 OUT-COUNT PIC 9(3).
		  03 OUT-LF    PIC X.
		WORKING-STORAGE SECTION.
		01 WS-COUNT    PIC 9(3) VALUE 0.
		PROCEDURE DIVISION.
		AA-START.
          OPEN INPUT IN-FILE.
          OPEN OUTPUT OUT-FILE.
        BB-READ.
          MOVE SPACES TO OUT-REC.
          READ IN-FILE AT END GO TO JJ-END.
          ADD 1 TO WS-COUNT.
          DISPLAY "READ " WS-COUNT " RECORDS".
        CC-WRITE.
          MOVE IN-GROUP TO OUT-GROUP.
		  MOVE FUNCTION CHAR(11) TO OUT-LF.
		  MOVE WS-COUNT TO OUT-COUNT.
          WRITE OUT-REC.
        DD-GOBACK.
          GO TO BB-READ.
        JJ-END.
		  CLOSE IN-FILE OUT-FILE.
		  DISPLAY "PROGRAM ENDED: EXITING"
		  STOP RUN.
