        IDENTIFICATION DIVISION.
        PROGRAM-ID. READM.
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 07/01/2026. 
        DATE-COMPILED. 07/01/2026. 
        SECURITY. free.
      * THIS CREATE AN INPUT FILE FOR PROGRAM EX01 .
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        INPUT-OUTPUT SECTION. 
        FILE-CONTROL.
          SELECT IN-FILE ASSIGN "barr10x5.asc".
        DATA DIVISION.
        FILE SECTION.
		FD IN-FILE.
		01 IN-REC.
		  03 IN-FIELD PIC 9(4) OCCURS 10.
		  03 LF PIC X.
		WORKING-STORAGE SECTION.
		01 AVG PIC 9(4) VALUE 0.
		01 RE-REC PIC 9(3) VALUE 0.
		01 COL-CNT PIC 9(2) VALUE 1.
		01 MIN PIC 9(3) VALUE 999.  
		01 MAX PIC S9(3) VALUE -999. 
		01 TEMP PIC 9(3). 
      * HIGH AND LOW ARE THE EXTREMES OF THE HISTOGRAM
		01 HIGH PIC 9(3). 
		01 LOW PIC 9(3). 
      * WIDTH IS THE WIDTH OF THE BUCKETS
		01 WIDTH PIC 9(3).
		01 K PIC 9(2).
		01 I PIC 9(2).
		01 LIM PIC 9(3)V99.
		01 ARRAY PIC S9(3) OCCURS 50.
		01 BCOUNT PIC 9(2) OCCURS 50.
		01 BLIMIT PIC 9(3)V99 OCCURS 50.
      * HMB: How Many Buckets		
		01 HMB PIC 9(3).
        PROCEDURE DIVISION.
		AA-START.
		  DISPLAY "#INSERT WIDTH".
		  ACCEPT WIDTH.
		  DISPLAY "#INSERT LOW".
		  ACCEPT LOW.
		  DISPLAY "#INSERT HIGH".
		  ACCEPT HIGH.
		  OPEN INPUT IN-FILE.
		BB-READ.
		  ADD 1 TO RE-REC.
		  READ IN-FILE AT END GO TO ZZ-END.
		  PERFORM 
			CC-PROCESS
			10 TIMES.
		  MOVE 1 TO COL-CNT.
		  GO TO BB-READ.
		CC-PROCESS.
          DISPLAY "#" COL-CNT " " IN-FIELD(COL-CNT).
          UNSTRING IN-FIELD(COL-CNT)
		  DELIMITED BY " "
		  INTO
            TEMP
          END-UNSTRING.
		  ADD TEMP TO AVG.
		  MOVE TEMP TO ARRAY((RE-REC - 1)*10+COL-CNT).
      *   DISPLAY "AVG = " AVG.
		  ADD 1 TO COL-CNT.
		AB-INIT.
		  IF HIGH < LOW
		    COMPUTE TEMP = LOW
		    COMPUTE LOW = HIGH
		    COMPUTE HIGH = TEMP.
		  IF WIDTH = -1
		    COMPUTE WIDTH = (HIGH - LOW)/10.
		  COMPUTE HMB = (HIGH - LOW)/WIDTH + 2.
		  PERFORM AC-DEFAULT
			VARYING I FROM 1 BY 1
			UNTIL I > HMB.
	    AC-DEFAULT.
	      MOVE 0 TO BCOUNT(I).
	      COMPUTE BLIMIT(I) = LIM.
	      ADD WIDTH TO LIM.
		DD-FILL.
	      PERFORM AB-INIT.
		  PERFORM DA-SRC VARYING K FROM 1 BY 1
		  UNTIL K=50.
		DA-SRC.
		  PERFORM EA-NONE
		    VARYING I FROM 1 BY 1 
		    UNTIL ARRAY(K) < BLIMIT(I).
      *		DISPLAY "FOUND " I " VAL " ARRAY(K) " LIM " 
      *		BLIMIT(I).
		  ADD 1 TO BCOUNT(I).
		EA-NONE.
      *	  DISPLAY I "VAL " ARRAY(K) " LIM " 
      *	  BLIMIT(I).
		FF-SHOWALL.
		  PERFORM GG-SHOW
		    VARYING I FROM 1 BY 1 UNTIL I = HMB.
		GG-SHOW.
		  DISPLAY I " " BLIMIT(I - 1) " " 
		  BLIMIT(I) " " BCOUNT(I).
	    ZZ-END.
		  PERFORM DD-FILL.
	      SUBTRACT 1 FROM RE-REC.
	      DISPLAY "#RECORDS READ: " RE-REC .
	      COMPUTE AVG = AVG/(10*RE-REC)
		  DISPLAY "#AVERAGE = " AVG.
		  PERFORM FF-SHOWALL.
		  DISPLAY "#PROGRAM ENDED: EXITING".
          CLOSE IN-FILE.
		  STOP RUN.
