		IDENTIFICATION DIVISION.
        PROGRAM-ID. MANIP. 
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 03/01/2026. 
        DATE-COMPILED. 03/01/2026. 
        SECURITY. free.
      * THIS PROGRAM ACCUMULATES SALARY DETAILS.
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 REC0.
			03 AA-FIELD PIC 9(5) VALUE 17613.
			03 BB-FIELD PIC 9(3).
		01 REC1.
			03 AA1-FIELD PIC 9(4) VALUE 4987.
			03 BB1-FIELD PIC 9(6).
			03 CC1-FIELD PIC 99V99 VALUE 1250.
		03 REC2.
			05 BB2-FIELD PIC 999V9.
			05 AA2-FIELD PIC 9(4)V99 VALUE 127835.
			05 CC2-FIELD PIC 9(6).
		05 REC3.
			07 AA3-FIELD PIC X(3) VALUE "ABC".
			07 BB3-FIELD PIC X(5).
		03 REC4.
			05 AA4-FIELD PIC 9(4) VALUE 1234.
			05 BB4-FIELD PIC X(5) VALUE "ABCDE".
		03 CC4-FIELD PIC X(6).
		01 REC5.
			03 A-NUM PIC 9(3)V99 VALUE 13.
			03 B-NUM PIC 9(3)V99 VALUE 11.
			03 C-NUM PIC 9(3)V99 VALUE 0.50.
			03 X-NUM PIC 9(3)V99 VALUE 0.0.
		PROCEDURE DIVISION.
		DISPLAY "AA-FIELD = " AA-FIELD.
		DISPLAY "BB-FIELD = " BB-FIELD.
		MOVE AA-FIELD TO BB-FIELD.
		DISPLAY "BB-FIELD = " BB-FIELD.
		DISPLAY "AA1-FIELD = " AA1-FIELD.
		DISPLAY "BB1-FIELD = " BB1-FIELD.
		DISPLAY "CC1-FIELD = " CC1-FIELD.
		MOVE AA1-FIELD TO BB1-FIELD.
		DISPLAY "BB1-FIELD = " BB1-FIELD.
		MOVE CC1-FIELD TO BB1-FIELD.
		DISPLAY "BB1-FIELD = " BB1-FIELD.
		DISPLAY "AA2-FIELD = " AA2-FIELD.
		DISPLAY "BB2-FIELD = " BB2-FIELD.
		DISPLAY "CC2-FIELD = " CC2-FIELD.
		MOVE AA2-FIELD TO BB2-FIELD.
		DISPLAY "BB2-FIELD = " BB2-FIELD.
		MOVE CC2-FIELD TO BB2-FIELD.
		DISPLAY "BB2-FIELD = " BB2-FIELD.
		DISPLAY "BB3-FIELD = " BB3-FIELD.
		DISPLAY "AA3-FIELD = " AA3-FIELD.
		MOVE AA3-FIELD TO BB3-FIELD.
		DISPLAY "BB3-FIELD = " BB3-FIELD.
		DISPLAY "AA4-FIELD = " AA4-FIELD.
		DISPLAY "BB4-FIELD = " BB4-FIELD.
		DISPLAY "CC4-FIELD = " CC4-FIELD.
		MOVE AA4-FIELD TO BB4-FIELD.
		DISPLAY "BB4-FIELD = " BB4-FIELD.
		MOVE AA4-FIELD TO CC4-FIELD.
		DISPLAY "CC4-FIELD = " CC4-FIELD.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		ADD A-NUM TO B-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		MOVE 100 TO A-NUM.
		MOVE 200 TO B-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		ADD A-NUM 20 GIVING B-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		MOVE 26 TO A-NUM.
		MOVE 13.5 TO B-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		ADD A-NUM TO B-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		MOVE 60 TO A-NUM.
		MOVE 120 TO B-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		SUBTRACT A-NUM FROM B-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		MOVE 12.5 TO A-NUM.
		MOVE 27.7 TO B-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		DISPLAY "C-NUM = " C-NUM.
		SUBTRACT A-NUM FROM B-NUM GIVING C-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		DISPLAY "C-NUM = " C-NUM.
		MOVE 032 TO A-NUM.
		DISPLAY "A-NUM = " A-NUM.
		MULTIPLY 10 BY A-NUM.
		DISPLAY "A-NUM = " A-NUM.
		MOVE 70 TO A-NUM.
		MOVE 10 TO B-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		MULTIPLY A-NUM BY B-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		MOVE 1.35 TO A-NUM.
		MOVE 100.5 TO B-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		MULTIPLY A-NUM BY 7 GIVING B-NUM ROUNDED.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		MOVE 15 TO A-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DIVIDE 5 INTO A-NUM.
		DISPLAY "A-NUM = " A-NUM.		
		MOVE 100 TO A-NUM.
		MOVE 24 TO B-NUM.
		MOVE 10 TO C-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		DISPLAY "C-NUM = " C-NUM.
		DIVIDE 12 INTO A-NUM GIVING B-NUM REMAINDER C-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		DISPLAY "C-NUM = " C-NUM.
      *	(a) A-NUM + C-NUM — 70 = x-NUM
      *		B-NUM
        MOVE 10.25 TO A-NUM.
        MOVE 33.47 TO B-NUM.
        MOVE 140.55 TO C-NUM.
		DISPLAY "A-NUM = " A-NUM.
		DISPLAY "B-NUM = " B-NUM.
		DISPLAY "C-NUM = " C-NUM.
		DISPLAY "X-NUM = " X-NUM.
        COMPUTE X-NUM = A-NUM/B-NUM + C-NUM - 70.
		DISPLAY "X-NUM = " X-NUM.
      *	(b) A-NUM X 60	= X-NUM
      *		   B-NUM
        COMPUTE X-NUM = (A-NUM * 60)/B-NUM + C-NUM - 70.
		DISPLAY "X-NUM = " X-NUM
        STOP RUN.

