		IDENTIFICATION DIVISION.
        PROGRAM-ID. MOVES. 
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 03/01/2026. 
        DATE-COMPILED. 03/01/2026. 
        SECURITY. free.
      * THIS PROGRAM APPLIES MOVES AND ARITHMETIC OPERATIONS.
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 TOTAL-FIELD PIC S9(6) COMP SYNC RIGHT VALUE -1789.
		01 WORK-FIELD PIC 9(6).
		01 DECI-FIELD PIC 9(4)V99 VALUE 1237.95.
		01 INT-FIELD PIC 9(4).
		01 GROUP-FIELD.
			03 GRP-1 PIC 9(4).
			03 GRP-2 PIC X(10).
			03 GRP-3 PIC 9(6)V99.
        01 NUM-FIELD PIC S9(4)V99.
		01 ALPH-FIELD PIC X(6).
		01 GROUP-FIELD2.
			03 A-FIELD PIC X(6).
			03 B-FIELD PIC A(10).
			03 C-FIELD PIC 9(6).
			03 D-FIELD PIC 9(6) COMP-3.
			03 E-FIELD PIC 9(8) COMP SYNC RIGHT.
			03 FILLER PIC X(7).
			03 F-FIELD PIC X(5) VALUE "TOTAL".
		01 X-FIELD  PIC  9(4)V99  VALUE  123.13.
		01 Y-FIELD  PIC  9(4)V99  VALUE 1004.14.
		01 N-FIELD  PIC  9(4)V9.
		01 X1-FIELD  PIC  9(4)  VALUE  7140.
		01 N1-FIELD  PIC  9(3)  VALUE   213.
		01 Z1-FIELD  PIC  9(4).
		01 X2-FIELD  PIC  9(3)V9  VALUE  572.
		01 N2-FIELD  PIC  9(3)V9  VALUE  304.
		01 Z2-FIELD  PIC  9(3)V9.
		01 X3-FIELD  PIC  9(4)  VALUE  7324.
		01 Y3-FIELD  PIC  9(6)  VALUE 98134.
		01 X4-FIELD  PIC  9(6)  VALUE  124716.
		01 Y4-FIELD  PIC  S9(6)  VALUE 112748.
		01 Z4-FIELD  PIC  S9(6).
		01 X5-FIELD  PIC  9(4)V999 VALUE  428.315.
		01 Y5-FIELD  PIC  9(5)V99  VALUE 134.69.
		01 X6-FIELD  PIC  9(4)V99 VALUE  2170.35.
		01 Y6-FIELD  PIC  9(4)V99  VALUE 174.95.
		01 Z6-FIELD  PIC  9(6)  VALUE 0.
		01 N6-FIELD  PIC  9(6)V99  VALUE 4123.44.
		01 X7-FIELD  PIC  9(6)  VALUE 0.
		01 Y7-FIELD  PIC  9(6)  VALUE 757987.
		01 Z7-FIELD  PIC  9(4)  VALUE 1241.
		01 N7-FIELD  PIC  9(3)  VALUE 1.
		01 X8-FIELD  PIC  9(6)  VALUE 6575.
		01 Y8-FIELD  PIC  9(3)  VALUE 5.
		01 Z8-FIELD  PIC  9(3)  VALUE 31.
		01 N8-FIELD  PIC  9(5)  VALUE 40765.
		PROCEDURE DIVISION.
		MOVE TOTAL-FIELD TO WORK-FIELD.        
        DISPLAY "TOTAL-FIELD = " TOTAL-FIELD.
        DISPLAY "WORK-FIELD = " WORK-FIELD.
        MOVE ZEROS TO TOTAL-FIELD.
        DISPLAY "TOTAL-FIELD = " TOTAL-FIELD.
        MOVE DECI-FIELD TO INT-FIELD
        DISPLAY "DECI-FIELD = " DECI-FIELD.
        DISPLAY "INT-FIELD = " INT-FIELD.
		MOVE SPACES TO GROUP-FIELD.
        DISPLAY "GROUP-FIELD = " GROUP-FIELD.
		MOVE ZEROS TO GROUP-FIELD.
        DISPLAY "GROUP-FIELD = " GROUP-FIELD.
        MOVE 1225 TO GRP-1
        MOVE "FrancescoL" TO GRP-2
        MOVE 125000.12 TO GRP-3
        DISPLAY "GROUP-FIELD = " GROUP-FIELD.
		MOVE 123 TO NUM-FIELD.
		DISPLAY "NUM-FIELD = " NUM-FIELD.
		MOVE 123.45 TO NUM-FIELD.
		DISPLAY "NUM-FIELD = " NUM-FIELD.
		MOVE -1234.67 TO NUM-FIELD.
		DISPLAY "NUM-FIELD = " NUM-FIELD.
		MOVE "DONKEY" TO ALPH-FIELD.
		DISPLAY "ALPH-FIELD = " ALPH-FIELD.
		MOVE "B" TO ALPH-FIELD.
		DISPLAY "ALPH-FIELD = " ALPH-FIELD.
		MOVE "1273-A" TO ALPH-FIELD.
		DISPLAY "ALPH-FIELD = " ALPH-FIELD.
		INITIALISE GROUP-FIELD2.
		DISPLAY "GROUP-FIELD2 = " GROUP-FIELD2.
		DISPLAY "A-FIELD = " A-FIELD.
		DISPLAY "B-FIELD = " B-FIELD.
		DISPLAY "C-FIELD = " C-FIELD.
		DISPLAY "D-FIELD = " D-FIELD.
		DISPLAY "E-FIELD = " E-FIELD.
		DISPLAY "F-FIELD = " F-FIELD.
		MOVE "Francesco." TO B-FIELD.
		DISPLAY "B-FIELD = " B-FIELD.
      	ADD X-FIELD Y-FIELD TO N-FIELD.
       	DISPLAY "N-FIELD = " N-FIELD.
       	MOVE ZEROS TO N-FIELD
       	ADD X-FIELD Y-FIELD TO N-FIELD ROUNDED.
       	DISPLAY "N-FIELD = " N-FIELD.
       	ADD X1-FIELD N1-FIELD GIVING Z1-FIELD.
       	DISPLAY "Z1-FIELD = " Z1-FIELD.
       	ADD X2-FIELD N2-FIELD GIVING Z2-FIELD.
       	DISPLAY "Z2-FIELD = " Z2-FIELD.
       	DISPLAY "X3-FIELD = " X3-FIELD.
       	DISPLAY "Y3-FIELD = " Y3-FIELD.
       	SUBTRACT X3-FIELD FROM Y3-FIELD.
       	DISPLAY "Y3-FIELD - X3-FIELD = " Y3-FIELD.
       	DISPLAY "X4-FIELD = " X4-FIELD.
       	DISPLAY "Y4-FIELD = " Y4-FIELD.
       	SUBTRACT X4-FIELD FROM Y4-FIELD.
       	DISPLAY "Y4-FIELD - X4-FIELD = " Y4-FIELD.
       	MOVE 1943 TO X4-FIELD.
       	MOVE 92466 TO Y4-FIELD
     	DISPLAY "X4-FIELD = " X4-FIELD.
       	DISPLAY "Y4-FIELD = " Y4-FIELD.
       	SUBTRACT X4-FIELD FROM Y4-FIELD GIVING Z4-FIELD.
       	DISPLAY "Y4-FIELD - X4-FIELD = " Z4-FIELD.
       	DISPLAY "Y4-FIELD = " Y4-FIELD.
		DISPLAY "X5-FIELD = " X5-FIELD.
       	DISPLAY "Y5-FIELD = " Y5-FIELD.
       	MULTIPLY X5-FIELD BY Y5-FIELD.
       	DISPLAY "X5-FIELD * Y5-FIELD = " Y5-FIELD.
       	MOVE 134.69 TO Y5-FIELD
       	MULTIPLY X5-FIELD BY Y5-FIELD ROUNDED.
       	DISPLAY "X5-FIELD * Y5-FIELD = " Y5-FIELD.
       	MOVE 134.69 TO Y5-FIELD
		DISPLAY "X6-FIELD = " X6-FIELD.
       	DISPLAY "Y6-FIELD = " Y6-FIELD.
       	DISPLAY "Z6-FIELD = " Z6-FIELD.
       	DISPLAY "N6-FIELD = " N6-FIELD.
       	MULTIPLY X6-FIELD BY Y6-FIELD GIVING Z6-FIELD ROUNDED N6-FIELD.
       	DISPLAY "Z6-FIELD = " Z6-FIELD.
       	DISPLAY "N6-FIELD = " N6-FIELD.
       	MOVE 1488 TO Y6-FIELD.
       	DIVIDE 365 INTO Y6-FIELD GIVING Z6-FIELD REMAINDER N6-FIELD.
       	DISPLAY "Z6-FIELD = " Z6-FIELD.
       	DISPLAY "N6-FIELD = " N6-FIELD.
       	DISPLAY "Y7-FIELD = " Y7-FIELD.
       	DISPLAY "Z7-FIELD = " Z7-FIELD.
       	DISPLAY "N7-FIELD = " N7-FIELD.
       	DIVIDE 365 INTO Y7-FIELD GIVING Z7-FIELD REMAINDER N7-FIELD.
       	MOVE 2 TO Z7-FIELD
       	MOVE 7 TO Y7-FIELD
       	DISPLAY "Y7-FIELD = " Y7-FIELD.
       	DISPLAY "Z7-FIELD = " Z7-FIELD.
       	DISPLAY "N7-FIELD = " N7-FIELD.
       	DISPLAY "X7-FIELD = " X7-FIELD.
       	COMPUTE X7-FIELD = N7-FIELD - Z7-FIELD.
       	DISPLAY "X7-FIELD = " X7-FIELD.
       	COMPUTE X7-FIELD = N7-FIELD / 43 * Z7-FIELD + Y7-FIELD * 205.
       	DISPLAY N7-FIELD "/ 43 * " Z7-FIELD " + " Y7-FIELD "* 205 = "
       	X7-FIELD.
       	DISPLAY "X8-FIELD = " X8-FIELD.
       	DISPLAY "Y8-FIELD = " Y8-FIELD.
       	DISPLAY "Z8-FIELD = " Z8-FIELD.
       	DISPLAY "N8-FIELD = " N8-FIELD.
       	COMPUTE X8-FIELD = N8-FIELD / Z8-FIELD * Y8-FIELD.
       	DISPLAY N8-FIELD " / " Z8-FIELD " * " Y8-FIELD " = " X8-FIELD
       	DISPLAY "X8-FIELD = " X8-FIELD.
       	COMPUTE X8-FIELD = N8-FIELD / (Z8-FIELD * Y8-FIELD).
       	DISPLAY N8-FIELD " / (" Z8-FIELD " * " Y8-FIELD ") = " X8-FIELD
        STOP RUN.

