      *SECT1 SECTION
      *PARA-A.
      *.
      *.
      *.
      *PARA-B.
      *.
      *.
      *.
      *PARA-D
      *EXIT.
      *SECT2 SECTION.  
      *.
      *.
      *.
      *.
        IDENTIFICATION DIVISION.
        PROGRAM-ID. PERFORM. 
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 04/01/2026. 
        DATE-COMPILED. 04/01/2026. 
        SECURITY. free.
      * THIS PROGRAM TESTS SOME KINDS OF BRANCHES.
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 REC0.
          03 IN-VAL   PIC S9(3).
        01  COUNTER    PIC 9(6) VALUE 1.
        PROCEDURE DIVISION.
        SECT0 SECTION.
        PARA-BRANCH.
        DISPLAY "PLEASE ENTER 0,1 OR 2 (-1 TO END)".
        ACCEPT IN-VAL.
        DISPLAY "IN-VAL is " IN-VAL.
        IF IN-VAL = -1 GO TO PARA-END.
        IF IN-VAL = 0
			DISPLAY "PERFORMING SECT1" 
			PERFORM SECT1.
		IF IN-VAL = 1 
			DISPLAY "PERFORMING PARA-A THRU PARA-D"
			PERFORM PARA-A THRU PARA-D. 
		IF IN-VAL = 2 
			DISPLAY "PERFORMING SECT2"
			PERFORM SECT2.
		DISPLAY "EXECUTION N. " COUNTER " ENDED"
		ADD 1 TO COUNTER
		GO TO PARA-BRANCH.
		SECT1 SECTION.
        PARA-A.
		DISPLAY "EXECUTING SECT1.PARA-A STEP 1".
		DISPLAY "EXECUTING SECT1.PARA-A STEP 2".
		DISPLAY "EXECUTING SECT1.PARA-A STEP 3".
        PARA-B.
		DISPLAY "EXECUTING SECT1.PARA-B STEP 1".
		DISPLAY "EXECUTING SECT1.PARA-B STEP 2".
		DISPLAY "EXECUTING SECT1.PARA-B STEP 3".
        PARA-D.
		DISPLAY "EXECUTING SECT1.PARA-D".
        EXIT.
        SECT2 SECTION.  
        PARA-E.
		DISPLAY "EXECUTING SECT2.PARA-E".
		GO TO PARA-BRANCH.
		PARA-END.
		DISPLAY "EXECUTING SECT2.PARA-END: EXITING PROGRAM ".
		STOP RUN.
      *which of the following statements are correct?
      *(a) PERFORM SECT1.
      *(b) PERFORM PARA—D THRU PARA-A.
      *(c) PERFORM SECT2 SECTION.
      * ANSWER: ONLY (a)
