      *100     FORMAT(I4,',',10(A20,','),A32)
      *WRITE(U,100) RID(TRID),ENAME(TRID),SURNAM(TRID),PLACE(TRID),
      *&PLNAM(TRID),PNUM(TRID),CITY(TRID),PROVIN(TRID),NATION(TRID),
      *&CELLN(TRID),HOMEN(TRID),EMAIL(TRID)
        IDENTIFICATION DIVISION.
        PROGRAM-ID. READPEOPLE.
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 06/01/2026. 
        DATE-COMPILED. 06/01/2026. 
        SECURITY. free.
      * THIS READS AND SHOWS CONTACTS FROM A CSV INPUT FILE
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        INPUT-OUTPUT SECTION. 
        FILE-CONTROL.
          SELECT IN-FILE ASSIGN "people.csv".
        DATA DIVISION.
        FILE SECTION.
		FD IN-FILE.
		01 CONTACT.
		  03 RID PIC 9(4).
		  03 FILLER PIC X.
		  03 NAME PIC X(20).
		  03 FILLER PIC X.
		  03 SURNAME PIC X(20).
		  03 FILLER PIC X.
		  03 PLACE PIC X(20).
		  03 FILLER PIC X.
		  03 PLACENAME PIC X(20).
		  03 FILLER PIC X.
		  03 PNUMBER PIC X(20).
		  03 FILLER PIC X.
		  03 CITY PIC X(20).
		  03 FILLER PIC X.
		  03 PROVINCE PIC X(20).
		  03 FILLER PIC X.
		  03 NATION PIC X(20).
		  03 FILLER PIC X.
		  03 CELLNUM PIC X(20).
		  03 FILLER PIC X.
		  03 HOMENUM PIC X(20).
		  03 FILLER PIC X.
		  03 EMAIL  PIC X(32).
		  03 FILLER PIC X.
		  WORKING-STORAGE SECTION.
    		01 RE-REC PIC 9(3) VALUE 0.
          PROCEDURE DIVISION.
		  AA-START.
		    OPEN INPUT IN-FILE.
		  BB-READ.
		    READ IN-FILE AT END GO TO ZZ-END.
		    ADD 1 TO RE-REC.
		    PERFORM CC-SHOW.
		    GO TO BB-READ.
       	  CC-SHOW.
            DISPLAY RID " " NAME " " SURNAME " " PLACE " " PLACENAME
		     PNUMBER " " CITY " " PROVINCE " " NATION
		     CELLNUM " " HOMENUM " " EMAIL.
	      ZZ-END.
	        CLOSE IN-FILE.
	        DISPLAY RE-REC " RECORDS READ".
		    DISPLAY "PROGRAM ENDED: EXITING".
		    STOP RUN.

      *WRITE(U,100) RID(TRID),ENAME(TRID),SURNAM(TRID),PLACE(TRID),
      *&PLNAM(TRID),PNUM(TRID),CITY(TRID),PROVIN(TRID),NATION(TRID),
      *&CELLN(TRID),HOMEN(TRID),EMAIL(TRID)
