        IDENTIFICATION DIVISION.
        PROGRAM-ID. READAM.
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 06/01/2026. 
        DATE-COMPILED. 06/01/2026. 
        SECURITY. free.
      * THIS CREATE AN INPUT FILE FOR PROGRAM EX01 .
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        INPUT-OUTPUT SECTION. 
        FILE-CONTROL.
          SELECT IN-FILE ASSIGN "OUT03.dat".
        DATA DIVISION.
        FILE SECTION.
		FD IN-FILE.
		01 IN-TOTALS.
			03 IN-MONTH-TOT PIC 9(8)V99 OCCURS 12.
		WORKING-STORAGE SECTION.
		01 WS-MONTH PIC 99 VALUE 01.
		01 RE-REC PIC 9(3) VALUE 00.
        PROCEDURE DIVISION.
		AA-START.
		  OPEN INPUT IN-FILE.
		  INITIALISE IN-TOTALS.
		BB-READ.
		  READ IN-FILE AT END GO TO ZZ-END.
		  ADD 1 TO RE-REC.
		CC-PROCESS.
		  DISPLAY "MONTH " 
		  WS-MONTH " AMOUNT " 
		  IN-MONTH-TOT(WS-MONTH).
		  ADD 1 TO WS-MONTH.
		  IF WS-MONTH < 12
		  			GO TO CC-PROCESS.	  
		  GO TO BB-READ.
	    ZZ-END.
	      DISPLAY RE-REC " RECORDS READ".
		  DISPLAY "PROGRAM ENDED: EXITING".
          CLOSE IN-FILE.
		  STOP RUN.
