        IDENTIFICATION DIVISION.
        PROGRAM-ID. READM.
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 06/01/2026. 
        DATE-COMPILED. 06/01/2026. 
        SECURITY. free.
      * THIS CREATE AN INPUT FILE FOR PROGRAM EX01 .
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        INPUT-OUTPUT SECTION. 
        FILE-CONTROL.
          SELECT IN-FILE ASSIGN "barr10x5.asc".
        DATA DIVISION.
        FILE SECTION.
		FD IN-FILE.
		01 IN-REC.
		  03 IN-FIELD PIC 9(4) OCCURS 10.
		  03 LF PIC X.
		WORKING-STORAGE SECTION.
		01 AVG PIC 9(4) VALUE 0.
		01 RE-REC PIC 9(3) VALUE 0.
		01 COL-CNT PIC 9(2) VALUE 1.
		01 TEMP PIC 9(3). 
        PROCEDURE DIVISION.
		AA-START.
		  OPEN INPUT IN-FILE.
		BB-READ.
		  ADD 1 TO RE-REC.
		  READ IN-FILE AT END GO TO ZZ-END.
		  PERFORM CC-PROCESS 10 TIMES.
		  MOVE 1 TO COL-CNT.
		  GO TO BB-READ.
		CC-PROCESS.
          DISPLAY COL-CNT " " IN-FIELD(COL-CNT).
          UNSTRING IN-FIELD(COL-CNT)
		  DELIMITED BY " "
		  INTO
            TEMP
          END-UNSTRING.
		  ADD TEMP TO AVG.
      *   DISPLAY "AVG = " AVG.
		  ADD 1 TO COL-CNT.
	    ZZ-END.
	      SUBTRACT 1 FROM RE-REC.
	      DISPLAY RE-REC " RECORDS READ".
	      COMPUTE AVG = AVG/(10*RE-REC)
		  DISPLAY "AVERAGE = " AVG.
		  DISPLAY "PROGRAM ENDED: EXITING".
          CLOSE IN-FILE.
		  STOP RUN.
