		IDENTIFICATION DIVISION.
        PROGRAM-ID. REC1. 
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 03/01/2026. 
        DATE-COMPILED. 03/01/2026. 
        SECURITY. free.
      * THIS PROGRAM ACCUMULATES SALARY DETAILS.
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 DA-RECORD.
          03 DA-TYPE		PIC X VALUE "a".
          03 DA-REC2.
		       05 DA-AREA		PIC X(5) VALUE "TRENO".
       		   05 DA-CODE		PIC 9(4) VALUE 5430.
          03 DA-GROUP REDEFINES DA-REC2 PIC X(9).
          03 DA-AMOUNT		PIC S9(6)V99 VALUE 120033.45.
          03 DA-COST		PIC 9(6) COMP SYNC RIGHT.
        PROCEDURE DIVISION.
        MOVE 378005 TO DA-COST.
        DISPLAY "DA-TYPE = " DA-TYPE.
        DISPLAY "DA-AREA = " DA-AREA.
        DISPLAY "DA-CODE = " DA-CODE.
        DISPLAY "DA-GROUP = " DA-GROUP.
        DISPLAY "DA-AMOUNT = " DA-AMOUNT.
        DISPLAY "DA-COST = " DA-COST.
        STOP RUN.

