		IDENTIFICATION DIVISION.
        PROGRAM-ID. REC2. 
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 03/01/2026. 
        DATE-COMPILED. 03/01/2026. 
        SECURITY. free.
      * THIS PROGRAM ACCUMULATES SALARY DETAILS.
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 DA-RECORD.
          03 DA-TYPE		PIC X VALUE "b".
          03 DA-ACCOUNT		PIC X(3) VALUE "ICH".
          03 DA-REC2.
			05 DA-AREA		PIC X(5) VALUE "HI!!!".
			05 DA-CODE		PIC 9(4) VALUE 2264.
		  03 DA-GROUP REDEFINES DA-REC2 PIC X(9).
          03 DA-AMOUNT		PIC 9(7) COMP-3 VALUE 1200331.
          03 A-FIELD        PIC 9(8) VALUE 333.
          03 B-FIELD REDEFINES A-FIELD PIC X(8).
        PROCEDURE DIVISION.
        DISPLAY "DA-TYPE = " DA-TYPE.
        DISPLAY "DA-ACCOUNT = " DA-ACCOUNT.
        DISPLAY "DA-AREA = " DA-AREA.
        DISPLAY "DA-CODE = " DA-CODE.
        DISPLAY "DA-GROUP = " DA-GROUP.
        DISPLAY "DA-AMOUNT = " DA-AMOUNT.
        DISPLAY "A-FIELD = " A-FIELD.
        DISPLAY "B-FIELD = " B-FIELD.
        STOP RUN.

