        IDENTIFICATION DIVISION.
        PROGRAM-ID. SDAT. 
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 02/01/2026. 
        DATE-COMPILED. 02/01/2026. 
        SECURITY. free.
      * THIS CREATE SALARY DETAILS FILE.
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo-Linux. 
        OBJECT-COMPUTER. Lenovo-Linux.
        INPUT-OUTPUT SECTION. 
        FILE-CONTROL.
			SELECT SALARY-FILE 
			ASSIGN TO "salscobc.dat".
      *      ORGANIZATION IS LINE SEQUENTIAL 
      *      file status is testfile-status
      *     ACCESS IS SEQUENTIAL.
        DATA DIVISION. 
			FILE SECTION. 
			FD SALARY-FILE.
			01 SALARY-RECORD.
				03 RECORD-TYPE         PIC X.
				03 FILLER              PIC X.
				03 SALARY              PIC 9(6).
				03 LF                  PIC X.
      * 	01 DETAIL-RECORD. 
      *	    03 DETAIL-NAME.		
      * 		05 DETAIL-INITIALS PIC XX.
      * 		05 DETAIL-SURNAME PIC X(15). 
      * 	03 DETAIL-ADDRESS.
      *			05 DETAIL-NUMBER PIC 9(4).
      *			05 DETAIL-STREET PIC x(20).
      *			05 DETAIL-TOWN PIC X(20).
        WORKING-STORAGE SECTION. 
		01 WS-SALREC.
				03 WS-RECTYPE         	  PIC X.
				03 WS-FILLER              PIC X.
				03 WS-SALARY              PIC 9(6).
				03 WS-LF                  PIC X.
        PROCEDURE DIVISION. 
        AA-START. 
            OPEN OUTPUT SALARY-FILE. 
		BB-WRITE. 
			MOVE "A" TO WS-RECTYPE.
			MOVE " " TO WS-FILLER.
			MOVE 001000 TO WS-SALARY
			MOVE FUNCTION CHAR(11) TO WS-LF
			MOVE WS-SALREC TO SALARY-RECORD.
			WRITE SALARY-RECORD.
			MOVE "B" TO WS-RECTYPE.
			MOVE " " TO WS-FILLER.
			MOVE 432060 TO WS-SALARY
			MOVE FUNCTION CHAR(11) TO WS-LF
			MOVE WS-SALREC TO SALARY-RECORD.
			WRITE SALARY-RECORD.
			MOVE "2" TO WS-RECTYPE.
			MOVE " " TO WS-FILLER.
			MOVE 72194 TO WS-SALARY
			MOVE FUNCTION CHAR(11) TO WS-LF
			MOVE WS-SALREC TO SALARY-RECORD.
			WRITE SALARY-RECORD.
			MOVE "1" TO WS-RECTYPE.
			MOVE " " TO WS-FILLER.
			MOVE 987081 TO WS-SALARY
			MOVE FUNCTION CHAR(11) TO WS-LF
			MOVE WS-SALREC TO SALARY-RECORD.
			WRITE SALARY-RECORD.
		CC-END.  
            CLOSE SALARY-FILE. 
			STOP RUN.
