        IDENTIFICATION DIVISION.
        PROGRAM-ID. SEQ. 
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 04/01/2026. 
        DATE-COMPILED. 04/01/2026. 
        SECURITY. free.
      * THIS WRITE DATA ON A SEQUENTIAL FILE READING AN INPUT FILE.
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        INPUT-OUTPUT SECTION. 
        FILE-CONTROL.
        SELECT FILE-IN ASSIGN "CRO1.dat".
		SELECT AMEND-OUT ASSIGN  "DAO1.dat".
		DATA DIVISION.
		FILE SECTION.
		FD FILE-IN.
		01 CARD-REC.
			03 CARD-TYPE PIC X.
			03 CARD-GROUP.
				05 CARD-AREA PIC 9.
				05 CARD-CODE PIC X(4).
			03 CARD-TOTAL-1 PIC 9(4).
			03 CARD-TOTAL-2 PIC 9(4).
			03 LF PIC X.
      *INPUT CARD RECORD - 3 VALID TYPES I, A, D.
      *Area 1 — SOUTHERN
      *Area 2 — EASTERN
      *Area 3 — NORTHERN
      *Area 4 — WESTERN
       FD AMEND-OUT.
       01 AMEND-REC-IA.
         03 AMEND-TYPE-IA PIC X VALUE "A".
         03 AMEND-GROUP-IA PIC X(5) VALUE "XXXXX".
         03 AMEND-NAME PIC X(14) VALUE "YYYYYYYYYYYYYY".
         03 AMEND-TOTAL PIC 9(6) VALUE 999999.
		 03 LF-IA PIC X.
      *OUTPUT RECORD 1 - 2 VALID TYPES I, or A
	   01 AMEND-REC-D.
         03 AMEND-TYPE-D PIC X VALUE "B".
         03 AMEND-GROUP-D PIC X(5) VALUE "ZZZZZ".
         03 AMEND-DEL PIC X(6) VALUE "RRRRRR".
		 03 LF-D PIC X.
      *OUTPUT RECORD 2 - 1 VALID TYPE D.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       AA-START.
	     OPEN INPUT FILE-IN.
         OPEN OUTPUT AMEND-OUT. 
       AB-READ.
		READ FILE-IN AT END GO TO ZZ-END.
		DISPLAY "READ " CARD-REC.
		MOVE SPACES TO AMEND-REC-IA.
		MOVE SPACES TO AMEND-REC-D.
	    IF CARD-TYPE = "I" OR
		   CARD-TYPE = "A" OR
           CARD-TYPE = "D"
		   NEXT SENTENCE
		ELSE
		   GO TO XX-INVALID.
		MOVE CARD-TYPE TO AMEND-TYPE-IA.
		IF CARD-AREA NOT NUMERIC GO TO XX-INVALID.
		IF CARD-AREA < 1 OR
		   CARD-AREA > 4 
		   GO TO XX-INVALID.
		MOVE CARD-GROUP TO AMEND-GROUP-IA.
		IF CARD-TYPE = "D"
			MOVE "DELETE" TO AMEND-DEL
			GO TO FF-WRITE-D.
		IF CARD-AREA  =  1
			MOVE "SOUTHERN" TO AMEND-NAME
			GO TO CC-TOTAL.
		IF CARD-AREA = 2
			MOVE "EASTERN" TO AMEND-NAME
			GO TO CC-TOTAL.
		IF CARD-AREA = 3	
			MOVE "NORTHERN" TO AMEND-NAME
			GO TO CC-TOTAL.
		IF CARD-AREA = 4
			MOVE "WESTERN" TO AMEND-NAME
			GO TO CC-TOTAL.
	   XX-INVALID.
	     DISPLAY "THE RECORD IS INVALID".
		 DISPLAY CARD-REC.
		 GO TO AB-READ.	   
	   CC-TOTAL.
	     DISPLAY "EXECUTING CC-TOTAL".
		 ADD CARD-TOTAL-1 CARD-TOTAL-2 GIVING AMEND-TOTAL.
	   DD-WRITE-IA.
		 MOVE FUNCTION CHAR(11) TO LF-IA.				
	     DISPLAY "WRITING " AMEND-REC-IA.
	     WRITE AMEND-REC-IA.
		 GO TO AB-READ.
	   FF-WRITE-D.
	     DISPLAY "EXECUTING FF-WRITE-D".
		 MOVE FUNCTION CHAR(11) TO LF-D.				
	     DISPLAY "WRITING " AMEND-REC-D.
	     WRITE AMEND-REC-D.
		 GO TO AB-READ.	
	   ZZ-END.
		 DISPLAY "PROGRAM ENDED: EXITING".
            CLOSE FILE-IN AMEND-OUT. 
		 STOP RUN.

