        IDENTIFICATION DIVISION.
        PROGRAM-ID. TABLE1.
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 06/01/2026. 
        DATE-COMPILED. 06/01/2026. 
        SECURITY. free.
      * THIS CREATE AN INPUT FILE FOR PROGRAM EX01 .
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        INPUT-OUTPUT SECTION. 
        FILE-CONTROL.
          SELECT IN-FILE ASSIGN "TAB01.dat".
          SELECT OUT-FILE ASSIGN "OUT02.dat".
        DATA DIVISION.
        FILE SECTION.
		FD IN-FILE.
		01 IN-REC.
		  03 R-NAME   PIC X(4) OCCURS 6 TIMES.
		  03 FILLER   PIC X.
		FD OUT-FILE.
		01 OUT-REC.
		  03 W-NAME   PIC X(4) OCCURS 6 TIMES.
		  03 LF       PIC X.
		WORKING-STORAGE SECTION.
		01 RE-REC   PIC 9(3) VALUE 0.
		01 WR-REC   PIC 9(3) VALUE 0.
        PROCEDURE DIVISION.
		AA-START.
		  OPEN INPUT IN-FILE.
		  OPEN OUTPUT OUT-FILE.
		BB-READ.
		  READ IN-FILE AT END GO TO ZZ-END.
          MOVE IN-REC TO OUT-REC.
          ADD 1 TO RE-REC.
        CC-PROCESS.
          WRITE OUT-REC.
          ADD 1 TO WR-REC.
          GO TO BB-READ.
        DD-ADDREC.
          MOVE SPACES TO OUT-REC.
	      MOVE "Ted" TO W-NAME(1).
	      MOVE "Mary" TO W-NAME(3).
	      MOVE FUNCTION CHAR(11) TO LF.
	      WRITE OUT-REC.
          ADD 1 TO WR-REC.
          MOVE SPACES TO OUT-REC.
	      MOVE "Olly" TO W-NAME(2).
	      MOVE "Asia" TO W-NAME(4).
	      MOVE FUNCTION CHAR(11) TO LF.
	      WRITE OUT-REC.
          ADD 1 TO WR-REC.
	    ZZ-END.
	      PERFORM DD-ADDREC.
	      DISPLAY RE-REC " RECORDS READ".
	      DISPLAY WR-REC " RECORDS WRITTEN".
		  DISPLAY "PROGRAM ENDED: EXITING".
          CLOSE IN-FILE.
          CLOSE OUT-FILE. 
		  STOP RUN.
