        IDENTIFICATION DIVISION.
        PROGRAM-ID. SAL. 
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 05/01/2026. 
        DATE-COMPILED. 05/01/2026. 
        SECURITY. free.
      * THIS PROGRAM COPY-UPDATES A MASTER FILE USING AN AMENDMENT FILE.
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        INPUT-OUTPUT SECTION. 
        FILE-CONTROL.
          SELECT MAST-IN ASSIGN "inMastDAO1.dat".
		  SELECT AMEND-IN ASSIGN "inAmendDAO3.dat".
		  SELECT MAST-OUT ASSIGN "outMastDAO2.dat".
		DATA DIVISION.
		FILE SECTION.
		FD MAST-IN.
		01 MAST-IN-REC.
		  03 MAST-IN-GROUP PIC X(5).
		  03 MAST-IN-NAME PIC X(14).
		  03 MAST-IN-TOTAL PIC 9(6).
		  03 MAST-IN-LF    PIC X.
		FD AMEND-IN.
		01 AMEND-REC.
		  03 AMEND-TYPE PIC X.
		  03 AMEND-GROUP PIC X(5). 
          03 AMEND-NAME PIC X(14).
          03 AMEND-TOTAL PIC 9(6).
        01 AMEND-REC-D.
          03 FILLER PIC X(6).
          03 AMEND-DEL PIC X(6).
      *The type and group on the D type record need not be pictured because
      *they are described on the other amend record. Remember, they share
      *the same piece of store and only one record can be in that store at a time
		FD MAST-OUT.
		01 MAST-OUT-REC.
		  03 MAST-OUT-GROUP PIC X(5).
          03 MAST-OUT-NAME PIC X(14).
          03 MAST-OUT-TOTAL PIC 9(6).        
		  03 MAST-OUT-LF    PIC X.
        PROCEDURE DIVISION.
		AA-START.
		  OPEN INPUT MAST-IN AMEND-IN.
		  OPEN OUTPUT MAST-OUT.
		BB-READ-MAST.
		  READ MAST-IN AT END
		  MOVE HIGH-VALUES TO MAST-IN-GROUP.
		CC-READ-AMEND.
		  READ AMEND-IN AT END
		  MOVE HIGH-VALUES TO AMEND-GROUP.
		DD-COMPARE.
		  DISPLAY "MAST-IN = " MAST-IN-REC. 
		  DISPLAY "AMEND-REC = " AMEND-REC.
		  DISPLAY "AMEND-REC-D = " AMEND-REC-D.
		  IF AMEND-GROUP = MAST-IN-GROUP 
		    GO TO EE-EQUAL.
		  IF AMEND-GROUP > MAST-IN-GROUP
			GO TO FF-MAST-ALONE.
		  IF AMEND-GROUP < MAST-IN-GROUP
			GO TO GG-AMEND-ALONE.
		  EE-EQUAL.
		    DISPLAY MAST-IN-GROUP " IS EQUAL TO " AMEND-GROUP.
		    DISPLAY "AMEND-TYPE = " AMEND-TYPE.
		    IF AMEND-GROUP = HIGH-VALUES GO TO JJ-END.
		    IF AMEND-TYPE = "D" GO TO EF-DELETE.
            IF AMEND-TYPE = "A" GO TO EG-AMEND.
            DISPLAY "INVALID RECORD".
            MOVE MAST-IN-REC TO MAST-OUT-REC.
            PERFORM HH-WRITE.
            GO TO BB-READ-MAST.
          EF-DELETE.
            DISPLAY AMEND-DEL AMEND-GROUP.
            GO TO BB-READ-MAST.
      * TYPE D DELETES A RECORD
          EG-AMEND.
            MOVE MAST-IN-REC TO MAST-OUT-REC.
			ADD AMEND-TOTAL TO MAST-OUT-TOTAL.
			PERFORM HH-WRITE.
			GO TO BB-READ-MAST.
      * TYPE A AMENDS A RECORD
		  FF-MAST-ALONE.
		    MOVE MAST-IN-REC TO MAST-OUT-REC.
		    PERFORM HH-WRITE.
            PERFORM BB-READ-MAST.
            GO TO DD-COMPARE.
      * NO AMENDMENT AND THE MASTER IS COPIED UNCHANGED
		  GG-AMEND-ALONE.
		    IF AMEND-TYPE = "I" GO TO GH-INSERT.
		    DISPLAY "INVALID RECORD" MAST-IN-REC AMEND-REC.
		    GO TO CC-READ-AMEND.
		  GH-INSERT.
		    MOVE AMEND-GROUP TO MAST-OUT-GROUP.
            MOVE AMEND-NAME TO MAST-OUT-NAME.
            MOVE AMEND-TOTAL TO MAST-OUT-TOTAL.
      * CREATE A NEW MASTER
	      HH-WRITE.
			  MOVE FUNCTION CHAR(11) TO MAST-OUT-LF.
			  WRITE MAST-OUT-REC.
		  II-RETURN.
		      GO TO CC-READ-AMEND.
      * INVALID TYPE I
      * COMPARE KEY FIELDS TO DETERMINE ACTION
		JJ-END. 
		  CLOSE MAST-IN AMEND-IN MAST-OUT.
		  STOP RUN.
		
