        IDENTIFICATION DIVISION.
        PROGRAM-ID. YEARTOT.
        AUTHOR. Francesco Lazzarotto.
        INSTALLATION. OK. 
        DATE-WRITTEN. 06/01/2026. 
        DATE-COMPILED. 06/01/2026. 
        SECURITY. free.
      * THIS CREATE AN INPUT FILE FOR PROGRAM EX01 .
        ENVIRONMENT DIVISION. 
        CONFIGURATION SECTION. 
        SOURCE-COMPUTER. Lenovo Linux. 
        OBJECT-COMPUTER. Lenovo Linux.
        INPUT-OUTPUT SECTION. 
        FILE-CONTROL.
          SELECT IN-FILE ASSIGN "IN01.dat".
          SELECT OUT-FILE ASSIGN "OUT03.dat".
        DATA DIVISION.
        FILE SECTION.
		FD IN-FILE.
		01 IN-REC.
			03 IN-MONTH PIC 99.
			03 IN-AMOUNT PIC 9(6)V99.
 		    03 FILLER   PIC X.
		FD OUT-FILE.
		01 W-TOTALS.
			03 W-MONTH-TOT PIC 9(8)V99 OCCURS 12.
		01 WS-REC1.
			03 WS-MTOT PIC S9(8)V99 OCCURS 12.
		WORKING-STORAGE SECTION.
		01 RE-REC   PIC 9(3)  VALUE 0.
		01 TEMP     PIC 9(3)  VALUE 0.
		01 WR-REC   PIC 9(3) VALUE 0.
        PROCEDURE DIVISION.
		AA-START.
		  OPEN INPUT IN-FILE.
		  OPEN OUTPUT OUT-FILE.
		  INITIALISE W-TOTALS.
		BB-READ.
		  READ IN-FILE AT END GO TO ZZ-END.
		  ADD 1 TO RE-REC.
		CC-PROCESS.
		  DISPLAY "MONTH " IN-MONTH " AMOUNT " IN-AMOUNT.
		  ADD IN-AMOUNT TO W-MONTH-TOT(IN-MONTH).		  
		  GO TO BB-READ.
		DD-WRITE.
       	  MOVE W-TOTALS TO WS-REC1.
		  WRITE WS-REC1.
		  MOVE RE-REC TO TEMP.
		  ADD 1 TO WR-REC.
	    ZZ-END.
	      PERFORM DD-WRITE.
	      DISPLAY TEMP " RECORDS READ".
	      DISPLAY WR-REC " RECORDS WRITTEN".
		  DISPLAY "PROGRAM ENDED: EXITING".
          CLOSE IN-FILE.
          CLOSE OUT-FILE. 
		  STOP RUN.
